[
	{
		"imdb_id": "tt0111161",
		"title": "The Shawshank Redemption",
		"poster_path": "https://image.tmdb.org/t/p/w300/2GgerXCbCMgvt2kLwWEmJWCSG65.jpg",
		"youtube_id": "PLl99DlL6b4",
		"genre": [
			{
				"genre_id": 2,
				"genre_name": "Drama"
			}
		],
		"admin_review": "I loved the acting in this movie. It was absolutely sublime!",
		"ranking": {
			"ranking_value": 1,
			"ranking_name": "Excellent"
		},
		"plot": "Andy Dufresne (Tim Robbins) is sentenced to two consecutive life terms in prison for the murders of his wife and her lover and is sentenced to a tough prison. However, only Andy knows he didn't commit the crimes. While there, he forms a friendship with Red (Morgan Freeman), experiences brutality of prison life, adapts, helps the warden, etc., all in 19 years."
	},
	{
		"imdb_id": "tt7131622",
		"title": "Once upon a time in Hollywood",
		"poster_path": "https://image.tmdb.org/t/p/w300/wQKeS2JrsRF8XSfd9zqflrc5gad.jpg",
		"youtube_id": "ELeMaP8EPAA",
		"genre": [
			{
				"genre_id": 2,
				"genre_name": "Drama"
			},
			{
				"genre_id": 1,
				"genre_name": "Comedy"
			}
		],
		"admin_review": "This movie is awful.",
		"ranking": {
			"ranking_name": "Terrible",
			"ranking_value": 5
		},
		"plot": "Actor Rick Dalton gained fame and fortune by starring in a 1950s television Western, but is now struggling to find meaningful work in a Hollywood that he doesn't recognize anymore. He spends most of his time drinking and palling around with Cliff Booth, his easygoing best friend and longtime stunt double. Rick also happens to live next door to Roman Polanski and Sharon Tate -- the filmmaker and budding actress whose futures will forever be altered by members of the Manson Family."
	},
	{
		"imdb_id": "tt0080339",
		"title": "Airplane!",
		"poster_path": "https://image.tmdb.org/t/p/w300/zOiB3p2WTTiwCFgTMnXuDGgzbTN.jpg",
		"youtube_id": "07pPmCfKi3U",
		"genre": [
			{
				"genre_id": 1,
				"genre_name": "Comedy"
			}
		],
		"admin_review": "I didn't love this movie but I didn't hate it either.",
		"ranking": {
			"ranking_value": 3,
			"ranking_name": "Okay"
		},
		"plot": "This spoof comedy takes shots at the slew of disaster movies that were released in the 70s. When the passengers and crew of a jet are incapacitated due to food poisoning, a rogue pilot with a drinking problem must cooperate with his ex-girlfriend turned stewardess to bring the plane to a safe landing."
	},
	{
		"imdb_id": "tt1119646",
		"title": "The Hangover",
		"poster_path": "https://image.tmdb.org/t/p/w300/c15rH9S5JN83UXqu9iM4TQsW6Rl.jpg",
		"youtube_id": "jj6wcUes1no",
		"genre": [
			{
				"genre_id": 1,
				"genre_name": "Comedy"
			}
		],
		"admin_review": "I didn't love this movie but I didn't hate it either.",
		"ranking": {
			"ranking_value": 3,
			"ranking_name": "Okay"
		},
		"plot": "Two days before his wedding, Doug (Justin Bartha) and three friends (Bradley Cooper, Ed Helms, Zach Galifianakis) drive to Las Vegas for a wild and memorable stag party. In fact, when the three groomsmen wake up the next morning, they can't remember a thing; nor can they find Doug. With little time to spare, the three hazy pals try to re-trace their steps and find Doug so they can get him back to Los Angeles in time to walk down the aisle."
	},
	{
		"imdb_id": "tt0109040",
		"title": "Ace Ventura: Pet Detective",
		"poster_path": "https://image.tmdb.org/t/p/w300/dukxJWd72ffNWfqfFSVFFuym4RG.jpg",
		"youtube_id": "qjBb1CKLpzE",
		"genre": [
			{
				"genre_id": 1,
				"genre_name": "Comedy"
			}
		],
		"admin_review": "This is really not so great.",
		"ranking": {
			"ranking_value": 4,
			"ranking_name": "Bad"
		},
		"plot": "When the dolphin mascot of Miami's NFL team is abducted, Ace Ventura, a zany private investigator who specializes in finding missing animals, looks into the case. Soon Miami Dolphins players are kidnapped too, including star player Dan Marino, making Ace's sleuth work even more pressing. Working with Dolphins representative Melissa Robinson, Ace closes in on the culprits, but not before many ridiculous misadventures."
	},
	{
		"imdb_id": "tt0105695",
		"title": "Unforgiven",
		"poster_path": "https://image.tmdb.org/t/p/w300/7W0CsZBe5fkX29DvHBi5Ct1WqLe.jpg",
		"youtube_id": "6_UlfsdGiEc",
		"genre": [
			{
				"genre_id": 2,
				"genre_name": "Drama"
			},
			{
				"genre_id": 3,
				"genre_name": "Western"
			}
		],
		"admin_review": "I hate this movie",
		"ranking": {
			"ranking_value": 5,
			"ranking_name": "Terrible\n"
		},
		"plot": "When prostitute Delilah Fitzgerald (Anna Thomson) is disfigured by a pair of cowboys in Big Whiskey, Wyoming, her fellow brothel workers post a reward for their murder, much to the displeasure of sheriff Little Bill Daggett (Gene Hackman), who doesn't allow vigilantism in his town. Two groups of gunfighters, one led by aging former bandit William Munny (Clint Eastwood), the other by the florid English Bob (Richard Harris), come to collect the reward, clashing with each other and the sheriff."
	},
	{
		"imdb_id": "tt0060196",
		"title": "The Good, The Bad, and the Ugly",
		"poster_path": "https://image.tmdb.org/t/p/w300/e881nA7p982CHL5GjI1LICwHMd7.jpg",
		"youtube_id": "WCN5JJY_wiA",
		"genre": [
			{
				"genre_id": 3,
				"genre_name": "Western"
			}
		],
		"admin_review": "I did not like this!",
		"ranking": {
			"ranking_value": 4,
			"ranking_name": "Bad"
		},
		"plot": "In the Southwest during the Civil War, a mysterious stranger, Joe (Clint Eastwood), and a Mexican outlaw, Tuco (Eli Wallach), form an uneasy partnership -- Joe turns in the bandit for the reward money, then rescues him just as he is being hanged. When Joe's shot at the noose goes awry during one escapade, a furious Tuco tries to have him murdered. The men re-team abruptly, however, to beat out a sadistic criminal and the Union army and find $20,000 that a soldier has buried in the desert."
	},
	{
		"imdb_id": "tt0903624",
		"title": "The Hobbit: An Unexpected Journey",
		"poster_path": "https://image.tmdb.org/t/p/w300/vdAGcr1F6wJPRryeODVAcy2mU4z.jpg",
		"youtube_id": "9PSXjr1gbjc",
		"genre": [
			{
				"genre_id": 4,
				"genre_name": "Fantasy"
			}
		],
		"admin_review": "The movie was aweful! I really hated it.",
		"ranking": {
			"ranking_value": 5,
			"ranking_name": "Terrible"
		},
		"plot": "Bilbo Baggins (Martin Freeman) lives a simple life with his fellow hobbits in the shire, until the wizard Gandalf (Ian McKellen) arrives and convinces him to join a group of dwarves on a quest to reclaim the kingdom of Erebor. The journey takes Bilbo on a path through treacherous lands swarming with orcs, goblins and other dangers, not the least of which is an encounter with Gollum (Andy Serkis) and a simple gold ring that is tied to the fate of Middle Earth in ways Bilbo cannot even fathom."
	},
	{
		"imdb_id": "tt0241527",
		"title": "Harry Potter and the Philosopher's Stone",
		"poster_path": "https://image.tmdb.org/t/p/w300/e6JYlushXIXK85JGfDHEFHrrNYK.jpg",
		"youtube_id": "VyHV0BRtdxo",
		"genre": [
			{
				"genre_id": 4,
				"genre_name": "Fantasy"
			}
		],
		"admin_review": "This movie wasn't great but it wasn't bad either.",
		"ranking": {
			"ranking_value": 3,
			"ranking_name": "Okay"
		},
		"plot": "Adaptation of the first of J.K. Rowling's popular children's novels about Harry Potter, a boy who learns on his eleventh birthday that he is the orphaned son of two powerful wizards and possesses unique magical powers of his own. He is summoned from his life as an unwanted child to become a student at Hogwarts, an English boarding school for wizards. There, he meets several friends who become his closest allies and help him discover the truth about his parents' mysterious deaths."
	},
	{
		"imdb_id": "tt2267998",
		"title": "Gone Girl",
		"poster_path": "https://image.tmdb.org/t/p/w300/xpA0q0DJWKe7AY63pVPZbGLwuo5.jpg",
		"youtube_id": "2-_-1nJf8Vg",
		"genre": [
			{
				"genre_id": 2,
				"genre_name": "Drama"
			},
			{
				"genre_id": 4,
				"genre_name": "Fantasy"
			}
		],
		"admin_review": "An okay but dark movie.",
		"ranking": {
			"ranking_value": 3,
			"ranking_name": "Okay"
		},
		"plot": "In Carthage, Mo., former New York-based writer Nick Dunne and his glamorous wife Amy present a portrait of a blissful marriage to the public; when Amy goes missing on the couple's fifth wedding anniversary, Nick becomes the prime suspect in her disappearance; the resulting police pressure and media frenzy cause the Dunnes' image of a happy union to crumble, leading to tantalizing questions about who Nick and Amy truly are."
	},
	{
		"imdb_id": "tt8946378",
		"title": "Knives Out",
		"poster_path": "https://image.tmdb.org/t/p/w300/hVcCOlHU0HmGBBQNmS9RlalBXGz.jpg",
		"youtube_id": "qGqiHJTsRkQ",
		"genre": [
			{
				"genre_id": 2,
				"genre_name": "Drama"
			},
			{
				"genre_id": 5,
				"genre_name": "Thriller"
			},
			{
				"genre_id": 8,
				"genre_name": "Mystery"
			}
		],
		"admin_review": "The story was fantastic and the acting was sublime!",
		"ranking": {
			"ranking_value": 1,
			"ranking_name": "Excellent"
		},
		"plot": "Knives Out is a 2019 American mystery comedy film written and directed by Rian Johnson. Daniel Craig leads an eleven-actor ensemble cast as Benoit Blanc, a famed private detective who is summoned to investigate the death of the bestselling author Harlan Thrombey (Christopher Plummer)."
	},
	{
		"imdb_id": "tt0080684",
		"title": "Star Wars: The Empire Strikes Back",
		"poster_path": "https://image.tmdb.org/t/p/w300/1mh82R1qLKwdutQVGnpHItdwPCP.jpg",
		"youtube_id": "JNwNXF9Y6kY",
		"genre": [
			{
				"genre_id": 6,
				"genre_name": "Sci-Fi"
			},
			{
				"genre_id": 4,
				"genre_name": "Fantasy"
			}
		],
		"admin_review": "This is okay!",
		"ranking": {
			"ranking_name": "Okay",
			"ranking_value": 3
		},
		"plot": "The adventure continues in this 'Star Wars' sequel. Luke Skywalker (Mark Hamill), Han Solo (Harrison Ford), Princess Leia (Carrie Fisher) and Chewbacca (Peter Mayhew) face attack by the Imperial forces and its AT-AT walkers on the ice planet Hoth. While Han and Leia escape in the Millennium Falcon, Luke travels to Dagobah in search of Yoda. Only with the Jedi master's help will Luke survive when the dark side of the Force beckons him into the ultimate duel with Darth Vader (David Prowse)."
	},
	{
		"imdb_id": "tt0102975",
		"title": "Star Trek: The Undiscovered Country",
		"poster_path": "https://image.tmdb.org/t/p/w300/jukY1tFpuXgqrJLl1PvdOMarCvN.jpg",
		"youtube_id": "RYA2q2Sm_Jo",
		"genre": [
			{
				"genre_id": 6,
				"genre_name": "Sci-Fi"
			},
			{
				"genre_id": 7,
				"genre_name": "Action"
			}
		],
		"admin_review": "It wasn't good but it wasn't too bad either.",
		"ranking": {
			"ranking_value": 3,
			"ranking_name": "Okay"
		},
		"plot": "Capt. James Kirk (William Shatner) and the crew of the USS Enterprise are carrying Klingon Chancellor Gorkon (David Warner) to Earth to negotiate a peace treaty with the United Federation of Planets. The ship appears to fire on a Klingon vessel, and Gorkon is killed in the subsequent confusion. Kirk and the ship's doctor, Leonard McCoy (DeForest Kelley), are arrested for murder, leaving Spock (Leonard Nimoy) to figure out who is behind the attack and save the negotiations."
	},
	{
		"imdb_id": "tt1297919",
		"title": "Blitz",
		"poster_path": "https://image.tmdb.org/t/p/w300/tI4fPu0LZ0FNdZdi6fvYGCRiuQs.jpg",
		"youtube_id": "mhO2WJ3MNRI",
		"genre": [
			{
				"genre_id": 9,
				"genre_name": "Crime"
			},
			{
				"genre_id": 7,
				"genre_name": "Action"
			},
			{
				"genre_id": 5,
				"genre_name": "Thriller"
			}
		],
		"admin_review": "This was a lovely movie!",
		"ranking": {
			"ranking_value": 1,
			"ranking_name": "Excellent"
		},
		"plot": "In World War II London, nine-year-old George is evacuated to the countryside by his mother, Rita, to escape the bombings. Defiant and determined to return to his family, George embarks on a journey back home as Rita searches for him."
	},
	{
		"imdb_id": "tt0790724",
		"title": "Jack Reacher",
		"poster_path": "https://image.tmdb.org/t/p/w300/8sih1uieUopA9zrEO1meNhmm7aO.jpg",
		"youtube_id": "A7FiWkyevqY",
		"genre": [
			{
				"genre_id": 7,
				"genre_name": "Action"
			},
			{
				"genre_id": 5,
				"genre_name": "Thriller"
			}
		],
		"admin_review": "This might be the worst movie that I have ever seen in my life!",
		"ranking": {
			"ranking_value": 5,
			"ranking_name": "Terrible"
		},
		"plot": "The story involves a sniper shooting five people, with all evidence pointing to a former military sniper named James Barr. Barr, who is in a coma, provides a single written message: 'Get Jack Reacher'. Reacher, a former Army investigator, arrives and initially agrees with the police that Barr is guilty, but his investigation uncovers inconsistencies that lead him to believe Barr is innocent, uncovering a wider conspiracy. "
	}
]
